In [1]:
# https://tidyr.tidyverse.org/reference/replace_na.html

from datar.all import *

print(replace_na.__doc__)

Replace NA with a value

    This function can be also used not as a verb. As a function called as
    an argument in a verb, _data is passed implicitly. Then one could
    pass series_or_replace as the data to replace.

    Args:
        _data: The data piped in
        series_or_replace: When called as argument of a verb, this is the
            data to replace. Otherwise this is the replacement.
        replace: The value to replace with

    Returns:
        Corresponding data with NAs replaced

In [2]:
df = tibble(x = c(1, 2, NA), y = c("a", NA, "b"))
df >> replace_na(dict(x = 0, y = "unknown"))

     x        y
0  1.0        a
1  2.0  unknown
2  0.0        b

In [3]:
df >> mutate(x = replace_na(f.x, 0))

     x    y
0  1.0    a
1  2.0  NaN
2  0.0    b

In [4]:
df.x >> replace_na(0)

0    1.0
1    2.0
2    0.0
Name: x, dtype: float64

In [5]:
df.y >> replace_na("unknown")

0          a
1    unknown
2          b
Name: y, dtype: object

In [6]:
# nested not supported yet